# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentId..::..IsValid Method
MEPNetworkSegmentId Class See Also
---
Verifies if this is a valid segment id.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if this is a valid segment id, otherwise false.
# See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace